{"src_lang": null, "tgt_lang": null, "eos_token": "</s>", "unk_token": "<unk>", "sep_token": "</s>", "cls_token": "<s>", "pad_token": "<pad>", "mask_token": {"content": "<mask>", "single_word": false, "lstrip": true, "rstrip": false, "normalized": true, "__type": "AddedToken"}, "bos_token": "<s>", "tokenizer_file": null, "language_codes": "ML50", "special_tokens_map_file": "/home/suraj/projects/mbart-50/mbart-50/special_tokens_map.json", "name_or_path": "/home/suraj/projects/mbart-50/hf_models/mbart-50-large-many-to-many/"}